{
	"header": {
		"firstName": "Kevin",
		"lastName": "Holmes",
		"phone": "970.481.0379",
		"email": "semlohnivek@hotmail.com"
	},
	"skills": {
		"list": [
		   {
		   	"name":"AngularJS (1.x)",
		   	"score": 3,
		   	"details": "Strong working knowledge of Angular.js and its core ideas - Single Page Application (SPA) framework, two-way data binding, Model-View-Whatever (MVW) paradigm."
		   },
		   {
		   	"name":"RESTful API Development",
		   	"score": 2,
		   	"details": "Helped build several RESTful APIs predominately with Ruby on Rails, though some minimal experience with Node.js"
		   },
		   {
		   	"name":"HTML5 & CSS3",
		   	"score": 2,
		   	"details": "Used extensively and generally competent, but still have days where nothing seems to line up right."
		   },		   
		   {
		   	"name":"Node.js",
		   	"score": 1,
		   	"details": "Mostly personal, home-based project experience.  But learning quickly and really enjoy using Node's rapid development capabilities."
		   },		   		   
		   {
		   	"name":"JavaScript",
		   	"score": 3,
		   	"details": "Certainly competent, but not a JS ninja."
		   },
		   {
		   	"name":"Bootstrap 3.x",
		   	"score": 2,
		   	"details": "Loved or hated, Bootstrap helps us graphically-challenged developers make things look pretty."
		   },
		   {
		   	"name":"Ruby on Rails",
		   	"score": 2,
		   	"details": "Written a fair amount of Ruby code in the Rails framework and have experience with gem installation, Rake, ActiveRecord, routes, etc...  But still plenty to learn."
		   },
		   {
		   	"name":"Git",
		   	"score": 2,
		   	"details": "Comfortable with general Git usage including branching, merging, pull requests, etc...  Not an expert, but with Google's help generally able to solve any Git task."
		   },
		   {
		   	"name":"Perl 5",
		   	"score": 3,
		   	"details": "One of my favorite languages.  Roughly five years of experience spent writing Perl 5 scripts for both Windows and Unix/Linux systems."
		   }
		]
		,
		"scoreMap": {
			"1": "Novice",
			"2": "Intermediate",
			"3": "Advanced",
			"4": "Expert"
		},
		"others": ["MySQL", "Highcharts and HighStock", "Apache", "IIS", "MongoDB", "D3 Visualization Library"],
		"spoken": [
		   {
		   	  "language": "English",
		   	  "level": "Fluent"
		   },
		   {
		   	  "language": "Spanish",
		   	  "level": "Intermediate"
		   },
		   {
		   	  "language": "Russian",
		   	  "level": "Basic"
		   }		   		   
		]
	},
	"employmentHistory": [
		{
			"title": "Sr. Web Engineer",
			"employer": {
				"name": "Visa Inc.",
				"city": "Highlands Ranch",
				"state": "CO"
			},
			"from": "August 2015",
			"to": "Present",
			"summary": "Mix of full-stack and strict front-end web development using AngularJS, Ruby on Rails, and MySQL for three different medium-scale web applications.",
			"highlights": [
				"Heavy use of open source JavaScript libraries including: AngularJS, jQuery, Angular UI, UI Router, and more.",
				"Build responsive and consistent UI layouts using Bootstrap and Bootstrap-based themes such as SmartAdmin and Inspinia.",
				"Develop RESTful API using Ruby on Rails, consumed on the front-end [mostly] using AngularJS Resource objects.",
				"Agile development model using Git, Stash/Bitbucket, and Jira.  Most releases based on 2-3 week sprints."
			]
		},
		{
			"title": "Contractor / Web Developer",
			"employer": {
				"name": "Consultant Specialists Inc.",
				"city": "Highlands Ranch",
				"state": "CO"
			},
			"from": "March 2014",
			"to": "July 2015",
			"summary": "Initially contracted with Visa Prepaid developing web services written in C# using XML payloads. Latter 10 months, moved to full-stack AngularJS, Ruby on Rails, and MySQL web application.",
			"highlights": [
				"Learned AngularJS and Ruby on Rails on the job.  Became proficient in both within a month.",
				"Began using tools such as Git, Stash, and Jira in an Agile based development project."
			]
		},
		{
			"title": "Sr. Systems Administrator",
			"employer": {
				"name": "Visa Inc.",
				"city": "Highlands Ranch",
				"state": "CO"
			},
			"from": "June 2004",
			"to": "November 2012",
			"summary": "Lead the Windows automation team for Visa’s operations department. Administered the source code repositories and defect tracking systems for Visa’s software development teams using IBM/Rational ClearCase and ClearQuest.",
			"highlights": [
				"Wrote server-side automation scripts using Perl, C# and Java – Some driven by the server scheduler, others driven by HPOO.",
				"Specialized in system monitoring and data gathering to provide usage metrics for servers and applications.",
				"Automated solutions allowed for over 50% of all help desk tickets to be completed automatically without human intervention."
			]
		}				
	],
	"activities": [
		{
			"title": "Volunteer Mentor",
			"organization": "American Corporate Partners (ACP)",
			"from": "January 2016",
			"to": "Present",
			"summary": "ACP is a service organization \"Connecting US Veterans to Business Leaders through Mentorships and Online Career Advice.\""
		}
	]
}